Fullmoon12185/stm32ebox/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "stm32f1xx_nucleo.h"

#include "stdio.h"
#include "string.h"


///* Private function prototypes -----------------------------------------------*/
//#ifdef __GNUC__
///* With GCC, small printf (option LD Linker->Libraries->Small printf
//   set to 'Yes') calls __io_putchar() */
//#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
//#else
//#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
//#endif /* __GNUC__ */

typedef enum
{
  ABNORMAL = 0,
  NORMAL = !ABNORMAL
} WorkingStatus;

#define DEBUG_INIT(X) 					X


/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* Private defines -----------------------------------------------------------*/

#define		BOX_ID		1


//#define B1_Pin 							GPIO_PIN_13
//#define B1_GPIO_Port 					GPIOC
//#define B1_EXTI_IRQn 					EXTI15_10_IRQn
//#define LD2_Pin 						GPIO_PIN_5
//#define LD2_GPIO_Port 					GPIOA

//#define TMS_Pin 						GPIO_PIN_13
//#define TMS_GPIO_Port 					GPIOA
//#define TCK_Pin 						GPIO_PIN_14
//#define TCK_GPIO_Port					GPIOA
//#define SWO_Pin 						GPIO_PIN_3
//#define SWO_GPIO_Port 					GPIOB



//#define LED1_PIN                         GPIO_PIN_5
//#define LED1_GPIO_PORT                   GPIOA
#define LED2_PIN                         GPIO_PIN_2
#define LED2_GPIO_PORT                   GPIOB
//#define LED3_PIN                         GPIO_PIN_8
//#define LED3_GPIO_PORT                   GPIOC
//#define LED4_PIN                         GPIO_PIN_5
//#define LED4_GPIO_PORT                   GPIOC




//LED output control signals
#define LED_SDI							GPIO_PIN_6
#define LED_SDI_PORT					GPIOC
#define LED_SCK							GPIO_PIN_3
#define LED_SCK_PORT					GPIOC
#define LED_LE							GPIO_PIN_4
#define LED_LE_PORT						GPIOC
#define LED_OE							GPIO_PIN_5
#define LED_OE_PORT						GPIOC

//BUZZER
#define PB5_BUZZER_PIN					GPIO_PIN_5
#define PB5_BUZZER_PORT					GPIOB
#define BUZZER_PIN						PB5_BUZZER_PIN
#define BUZZER_PORT						PB5_BUZZER_PORT


//3G control signals pins ports
#define PC7_3G_WAKEUP					GPIO_PIN_7
#define PC7_3G_WAKEUP_PORT				GPIOC
#define PC8_3G_PWRON					GPIO_PIN_8
#define PC8_3G_PWRON_PORT				GPIOC
#define PC9_3G_PERST					GPIO_PIN_9
#define PC9_3G_PERST_PORT				GPIOC
#define PA8_3G_REG_EN					GPIO_PIN_8
#define PA8_3G_REG_EN_PORT				GPIOA

#define SIM5320_3G_WAKEUP					PC7_3G_WAKEUP
#define SIM5320_3G_WAKEUP_PORT				PC7_3G_WAKEUP_PORT
#define SIM5320_3G_PWRON					PC8_3G_PWRON
#define SIM5320_3G_PWRON_PORT				PC8_3G_PWRON_PORT
#define SIM5320_3G_PERST					PC9_3G_PERST
#define SIM5320_3G_PERST_PORT				PC9_3G_PERST_PORT
#define SIM5320_3G_REG_EN					PA8_3G_REG_EN
#define SIM5320_3G_REG_EN_PORT				PA8_3G_REG_EN_PORT

//timer
#define TIMx                           TIM3
#define TIMx_CLK_ENABLE()              __HAL_RCC_TIM3_CLK_ENABLE()


/* Definition for TIMx's NVIC */
#define TIMx_IRQn                      TIM3_IRQn
#define TIMx_IRQHandler                TIM3_IRQHandler



/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* User can use this section to tailor USARTx/UARTx instance used and associated
   resources */
/* Definition for USARTx clock resources */
#define USART1_CLK_ENABLE()              __HAL_RCC_USART1_CLK_ENABLE();
#define DMA1_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
#define USART1_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
#define USART1_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()

#define USART1_FORCE_RESET()             __HAL_RCC_USART1_FORCE_RESET()
#define USART1_RELEASE_RESET()           __HAL_RCC_USART1_RELEASE_RESET()

/* Definition for USARTx Pins */
#define USART1_TX_PIN                    GPIO_PIN_9
#define USART1_TX_GPIO_PORT              GPIOA
#define USART1_RX_PIN                    GPIO_PIN_10
#define USART1_RX_GPIO_PORT              GPIOA




/* Exported macro ------------------------------------------------------------*/
#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))
/* Size of Trasmission buffer */
#define TXBUFFERSIZE                      (COUNTOF(aTxBuffer) - 1)
/* Size of Reception buffer */
#define RXBUFFERSIZE                      100




#define USART2_TX_PIN 					GPIO_PIN_2
#define USART2_TX_GPIO_PORT 				GPIOA
#define USART2_RX_PIN 					GPIO_PIN_3
#define USART2_RX_GPIO_PORT 				GPIOA

#define USART2_CLK_ENABLE()              __HAL_RCC_USART2_CLK_ENABLE();
#define DMA2_CLK_ENABLE()                __HAL_RCC_DMA2_CLK_ENABLE()
#define USART2_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
#define USART2_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()

#define USART2_FORCE_RESET()             __HAL_RCC_USART2_FORCE_RESET()
#define USART2_RELEASE_RESET()           __HAL_RCC_USART2_RELEASE_RESET()

///////////////////////////////////////////////////////////////////////////////
#define USART3_TX_PIN 					GPIO_PIN_10
#define USART3_TX_GPIO_PORT 				GPIOB
#define USART3_RX_PIN 					GPIO_PIN_11
#define USART3_RX_GPIO_PORT 				GPIOB

#define USART3_CLK_ENABLE()              __HAL_RCC_USART3_CLK_ENABLE();
#define DMA3_CLK_ENABLE()                __HAL_RCC_DMA3_CLK_ENABLE()
#define USART3_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define USART3_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()

#define USART3_FORCE_RESET()             __HAL_RCC_USART3_FORCE_RESET()
#define USART3_RELEASE_RESET()           __HAL_RCC_USART3_RELEASE_RESET()


#define		SAMPLE_STEPS							2
#define 	NUMBER_OF_SAMPLES_PER_AVERAGE			(1 << SAMPLE_STEPS)
#define 	NUMBER_OF_SAMPLES_PER_SECOND			300
#define 	NUMBER_OF_ADC_CHANNELS					14

#define 	ZERO_POINT_DETECTION_PIN				GPIO_PIN_14
#define 	ZERO_POINT_DETECTION_PORT				GPIOC


//SPI2
#define MASTER_BOARD
#define SPI2_CLK_ENABLE()                __HAL_RCC_SPI2_CLK_ENABLE()
#define SPI2_SCK_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOB_CLK_ENABLE()
#define SPI2_MISO_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define SPI2_MOSI_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()

/* Definition for SPIx Pins */
#define SPI2_NSS_PIN                     GPIO_PIN_12
#define SPI2_NSS_GPIO_PORT               GPIOB

#define SPI2_SCK_PIN                     GPIO_PIN_13
#define SPI2_SCK_GPIO_PORT               GPIOB
#define SPI2_MISO_PIN                    GPIO_PIN_14
#define SPI2_MISO_GPIO_PORT              GPIOB
#define SPI2_MOSI_PIN                    GPIO_PIN_15
#define SPI2_MOSI_GPIO_PORT              GPIOB




//I2C
#define I2C1_CLK_ENABLE()               __HAL_RCC_I2C1_CLK_ENABLE()
#define I2C1_SDA_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define I2C1_SCL_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()

#define I2C1_FORCE_RESET()              __HAL_RCC_I2C1_FORCE_RESET()
#define I2C1_RELEASE_RESET()            __HAL_RCC_I2C1_RELEASE_RESET()

/* Definition for I2Cx Pins */
#define I2C1_SCL_PIN                    GPIO_PIN_6
#define I2C1_SCL_GPIO_PORT              GPIOB
#define I2C1_SDA_PIN                    GPIO_PIN_7
#define I2C1_SDA_GPIO_PORT              GPIOB




//pcf8574 inputs
#define I2C_BUFFERSIZE 		1
#define I2C_ADDRESS_GPIO0	0
#define I2C_ADDRESS_GPIO1	4
#define I2C_ADDRESS_GPIO2	6

#define SAC10				0
#define SAC20				1
#define SAC11				2
#define SAC21				3
#define SAC12				4
#define SAC22				5
#define SAC13				6
#define SAC23				7
#define SAC14				8
#define SAC24				9
#define SAC15				10
#define SAC25				11
#define SAC16				12
#define SAC26				13
#define SAC17				14
#define SAC27				15
#define SAC18				16
#define SAC28				17
#define SAC19				18
#define SAC29				19

//Relay
#define	NUMBER_OF_RELAYS	10
#define RELAY_0				0
#define RELAY_1				1
#define RELAY_2				2
#define RELAY_3				3
#define RELAY_4				4
#define RELAY_5				5
#define RELAY_6				6
#define RELAY_7				7
#define RELAY_8				8
#define RELAY_9				9

//Relay control pins and ports
#define PA11_OUT0						GPIO_PIN_11
#define PA11_OUT0_PORT					GPIOA
#define PA12_OUT1						GPIO_PIN_12
#define PA12_OUT1_PORT					GPIOA
#define PB8_OUT2						GPIO_PIN_8
#define PB8_OUT2_PORT					GPIOB
#define PB9_OUT3						GPIO_PIN_9
#define PB9_OUT3_PORT					GPIOB
#define PA15_OUT4						GPIO_PIN_15
#define PA15_OUT4_PORT					GPIOA

#define PC10_OUT5						GPIO_PIN_10
#define PC10_OUT5_PORT					GPIOC
#define PC11_OUT6						GPIO_PIN_11
#define PC11_OUT6_PORT					GPIOC
#define PC12_OUT7						GPIO_PIN_12
#define PC12_OUT7_PORT					GPIOC

#define PB3_OUT8						GPIO_PIN_3
#define PB3_OUT8_PORT					GPIOB

#define PB4_OUT9						GPIO_PIN_4
#define PB4_OUT9_PORT					GPIOB



#define RELAY_PIN_0						PA11_OUT0
#define RELAY_PIN_1						PA12_OUT1
#define RELAY_PIN_2						PB8_OUT2
#define RELAY_PIN_3						PB9_OUT3
#define RELAY_PIN_4						PA15_OUT4
#define RELAY_PIN_5						PC10_OUT5
#define RELAY_PIN_6						PC11_OUT6
#define RELAY_PIN_7						PC12_OUT7
#define RELAY_PIN_8						PB3_OUT8
#define RELAY_PIN_9						PB4_OUT9

#define RELAY_PORT_0						PA11_OUT0_PORT
#define RELAY_PORT_1						PA12_OUT1_PORT
#define RELAY_PORT_2						PB8_OUT2_PORT
#define RELAY_PORT_3						PB9_OUT3_PORT
#define RELAY_PORT_4						PA15_OUT4_PORT
#define RELAY_PORT_5						PC10_OUT5_PORT
#define RELAY_PORT_6						PC11_OUT6_PORT
#define RELAY_PORT_7						PC12_OUT7_PORT
#define RELAY_PORT_8						PB3_OUT8_PORT
#define RELAY_PORT_9						PB4_OUT9_PORT




#define		NUMBER_OF_SUBSCRIBE_TOPIC	2
#define		NUMBER_OF_PUBLISH_TOPIC		2

#define 	SUBSCRIBE_RECEIVE_MESSAGE_TYPE 		48
#define 	LEN_SUBSCRIBE_RECEIVE_MESSAGE_TYPE 	16

//Vinh add begin

//fsm Main
#define FSM_Main_FINISH				0
#define FSM_Main_BEGIN				1
//#define
#define FSM_Main_CHECK_STATUS		2
#define FSM_Main_CHECK_SYSTEM		4
#define FSM_Main_CHECK_COMMAND		3
#define FSM_Main_ERR_HANDLE			5
#define FSM_Main_WAR_HANDLE			6

#define No_CHANNEL 10

enum NodeName {
	SYSTEM = 0,
	NODE1 = 1,
	NODE2 = 2,
	NODE3 = 3,
	NODE4 = 4,
	NODE5 = 5,
	NODE6 = 6,
	NODE7 = 7,
	NODE8 = 8,
	NODE9 = 9,
	NODE10 = 10,
};

enum NodeStatus {
	NODENORMAL 		= 	0,
	CHARGING		=	1,
	CHARGEFULL		=	2,
	UNPLUG			=	3,
	NOPOWER			=	4,
	NOFUSE			=	5,
	NORELAY			=	6,
	NODEOVERCURRENT	=	7,
	NODEOVERMONEY	=	8,
	NODEOVERTIME	=	9
};

//cap dien ma chua cam thi time out
// dang sac het thoi gian thi timeout
// dang sac ma rut thi cung boa UNPLUG
// kiem tra fuse vaf relay

enum SystemStatus {
	SYSTEMNORMAL		=	0,
	NODEOVERTOTAL		=	1,
	NODEUNDERTOTAL		=	2,
	SYSTEMOVERCURRENT	=	3,
	SYSTEMOVERTEMP		=	4,
	SYSTEMSHAKING		=	5,
	SYSTEMNOINTERNET	=	6
};
//...

typedef struct PowerNodes {
//	uint8_t nodeID;				//1 to 10
	enum NodeStatus  nodeStatus;			//avaiable = 0; charging = 1;	chargefull = 2
//	uint16_t nodeValue;			//Adc PP value , ADC value
	uint32_t current;	// in uA
//	uint8_t voltage;	// = 220
//	uint8_t frequency;	// = 50 in Hz
	uint8_t powerFactor; // = 1pF
	uint32_t lastPower;
	uint32_t power;		// in mW
//	uint32_t workingTime;		//from start to now
	uint32_t energy; 	// in mWs
	uint32_t limitEnergy;		//set this value from web app
} PowerNode;

typedef struct PowerSystems {
	PowerNode nodes[10];
	uint16_t valueRef;	//read from 1v8
	uint16_t valueTotal;			//total Adc PP from Main CT
	float currentTotal;			//sum of all channel
	float refTotalCurrent;		//read from Big CT
	enum SystemStatus status;				//as in enum SystemStatus
	uint8_t ambientTemp;
	uint8_t internalTemp;

} powerSystem;

typedef struct Commands {
	uint8_t target;
	uint8_t command;
	uint8_t data;
} Command;
extern powerSystem Main;
//powerSystem Main;

void power_setup();
//void power_loop();
//void power_loop2();
void power_loop3();

//Vinh add

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
